<p>
    多年互联网、手机平板和智能设备公司工作经历，非常熟悉网页端、桌面端、移动端的界面设计规范和流程。尤其在基于 Android 平台的系统界面定制、资源输出、屏幕适配等各方面有丰富经验，了解 Android 开发基础知识和编程，可在工作中减少设计师与开发人员的沟通成本，帮助设计方案完美落地。曾参与了多个 Android 整机项目的 UI 设计，能够独立制定完整的设计系统、UI 规范。
</p>
<p>
    熟悉各种类型等网站的 UI 设计和视觉设计。熟悉 HTML5、CSS3、JavaScript 编程、响应式设计、页面动画、图像优化等，能够独立完成静态页面开发。有大型网站的 CSS (包括 PostCSS, SASS, LESS 等) 开发经验，能够独立或基于 Bootstrap、Tailwind CSS、常见前端 UI 框架定制 UI 或组件，熟悉 Git、Shell 以及常见前端流程和工具，在与开发沟通协作上没有任何障碍。对 Node.js、Electron 跨平台桌面应用框架、服务端等 Web 相关技术也有一定了解。
</p>
<p>
    具备扎实的艺术理论和设计功底，时常关注工作相关业界动态和前沿技，善于学习和总结经验。精通目前主流设计软件，熟悉平面设计、图标插图、摄影、交互等相关技术。在设计工程化方面有比较突出的优势，能够帮助团队提高工作效率，降低沟通时间，实际工作中做过插件开发、批处理脚本、Web/桌面端程序等业务相关工具。目前在 Sketch 和 Figma 的插件开发方面有较丰富经验，已发布多个开源插件，并且在业内拥有不错的反响。
</p>
